[
    {
        "id": 1,
        "name": "All India Trinamool Congress Party Manifesto English (2024)",
        "analysis": {
            "summary": "This manifesto focuses on extending Bengal's state-level welfare programs, such as direct cash assistance and free rations, to the national level. It strongly opposes the policies of the current Union Government, advocating for greater states' rights, the repeal of controversial laws like the CAA, and increased social security spending. The overall vision is a welfare state with significant government intervention in the economy to support workers, farmers, and marginalized communities.",
            "policy_scores": {
                "Economy": {
                    "score": 1,
                    "explanation": "The party proposes controlling fuel prices, providing free cooking gas cylinders to poor families, and reforming GST for more equitable revenue distribution."
                },
                "Education": {
                    "score": 1,
                    "explanation": "The party aims to double the national education budget and increase scholarships and financial aid for students, especially from marginalized communities."
                },
                "Technology": {
                    "score": 2,
                    "explanation": "The party plans to introduce a new bill to protect citizens' digital rights from surveillance and data breaches."
                },
                "Environment": {
                    "score": 2,
                    "explanation": "The party advocates for strengthening environmental laws, increasing forest cover, and restoring natural habitats like mangroves and wetlands."
                },
                "Healthcare": {
                    "score": 1,
                    "explanation": "The party proposes to triple the national healthcare budget and replace the current insurance scheme with one offering double the coverage for all."
                },
                "Defense": {
                    "score": 3,
                    "explanation": "The party plans to scrap the Agnipath recruitment scheme and restore traditional military recruitment methods."
                },
                "Infrastructure": {
                    "score": 2,
                    "explanation": "The party promises large-scale public works projects including guaranteed housing for the poor, universal tap water, and modernizing railways."
                },
                "Foreign Policy": {
                    "score": 3,
                    "explanation": "This policy was not clearly mentioned."
                },
                "Social Justice": {
                    "score": 1,
                    "explanation": "The party plans to abolish the Citizenship Amendment Act (CAA), reject a Uniform Civil Code, and expand welfare schemes for women and marginalized communities."
                },
                "Agriculture": {
                    "score": 1,
                    "explanation": "The party promises to legally guarantee a minimum support price for all crops, set at least 50% above the cost of production."
                }
            }
        }
    },
    {
        "id": 2,
        "name": "Communist Party Of India (Marxist) Manifesto English (2024)",
        "analysis": {
            "summary": "This manifesto presents a comprehensive critique of the incumbent BJP government, accusing it of undermining India's secular democratic constitution and promoting a corporate-communal nexus. It calls for the defeat of the BJP to save the republic and proposes a set of alternative, pro-people policies focused on strengthening the public sector, ensuring social justice, and re-establishing a non-aligned foreign policy.",
            "policy_scores": {
                "Economy": {
                    "score": 1,
                    "explanation": "The party advocates for reversing privatization, taxing the wealthy, and significantly strengthening the public sector's role in the economy."
                },
                "Education": {
                    "score": 1,
                    "explanation": "The party wants to significantly increase public funding for education to 6% of GDP and reverse policies of privatization and commercialization."
                },
                "Technology": {
                    "score": 2,
                    "explanation": "The party advocates for strong regulation of big tech companies, promoting public sector alternatives, and protecting citizens' digital privacy."
                },
                "Environment": {
                    "score": 1,
                    "explanation": "The party proposes strengthening environmental regulations, planning a just transition away from fossil fuels, and repealing pro-corporate environmental policies."
                },
                "Healthcare": {
                    "score": 1,
                    "explanation": "The party advocates for a universal, publicly funded healthcare system with free services and aims to raise health spending to 5% of GDP."
                },
                "Defense": {
                    "score": 1,
                    "explanation": "The party advocates for strengthening public sector defense manufacturing, ending contract-based military recruitment, and withdrawing from military alliances with the US."
                },
                "Infrastructure": {
                    "score": 1,
                    "explanation": "The party proposes to reverse the privatization of national infrastructure and have it built and managed exclusively by the public sector."
                },
                "Foreign Policy": {
                    "score": 1,
                    "explanation": "The party calls for a non-aligned foreign policy, withdrawing from strategic alliances with the United States, and strengthening relations with developing countries."
                },
                "Social Justice": {
                    "score": 1,
                    "explanation": "The party advocates for expanding reservations to the private sector, conducting a caste census, and enacting laws to protect minorities and LGBTQ+ rights."
                },
                "Agriculture": {
                    "score": 1,
                    "explanation": "The party supports a legal guarantee for crop prices (MSP), a comprehensive farm loan waiver, and increased public investment in agriculture."
                }
            }
        }
    },
    {
        "id": 3,
        "name": "Communist Party Of India Manifesto English (2024)",
        "analysis": {
            "summary": "This manifesto presents a strong critique of the incumbent government, framing its policies as pro-corporate and divisive. It advocates for a significant shift towards a state-led economy with wealth redistribution, expanded social justice measures like reservations, and the protection of secular, constitutional values.",
            "policy_scores": {
                "Economy": {
                    "score": 1,
                    "explanation": "The party proposes strong government intervention, including wealth and inheritance taxes, increased corporate taxes, and an end to the privatization of public assets."
                },
                "Education": {
                    "score": 1,
                    "explanation": "The manifesto advocates for scrapping the New Education Policy and significantly increasing public spending to ensure free, universal, and secular education for all."
                },
                "Technology": {
                    "score": 2,
                    "explanation": "The party supports harnessing new technologies like AI for public benefit and increasing public investment in R&D, while protecting intellectual property for people over corporations."
                },
                "Environment": {
                    "score": 1,
                    "explanation": "The party calls for strong laws to conserve forests and water bodies, remove encroachments by mining lobbies, and focus on renewable energy sources."
                },
                "Healthcare": {
                    "score": 1,
                    "explanation": "It proposes a major increase in public health spending to 6% of GDP, radical improvements in public hospitals, and regulation of the private healthcare system."
                },
                "Defense": {
                    "score": 2,
                    "explanation": "The party demands the scrapping of the contractual Agnipath scheme to restore older, more permanent service conditions for armed forces personnel."
                },
                "Infrastructure": {
                    "score": 2,
                    "explanation": "The manifesto commits to developing urban infrastructure and constructing affordable housing within the public sector to improve living conditions."
                },
                "Foreign Policy": {
                    "score": 1,
                    "explanation": "The party advocates for an independent, anti-imperialist foreign policy, strengthening ties with the Global South and expressing solidarity with Palestine."
                },
                "Social Justice": {
                    "score": 1,
                    "explanation": "The manifesto strongly supports extending reservations to the private sector, removing the 50% cap, repealing the CAA, and implementing women's reservation immediately."
                },
                "Agriculture": {
                    "score": 1,
                    "explanation": "It supports farmers with proposals for a comprehensive loan waiver, a legal guarantee for minimum support prices, and promoting public sector storage systems."
                }
            }
        }
    },
    {
        "id": 4,
        "name": "Indian National Congress Party Manifesto English (2024)",
        "analysis": {
            "summary": "This manifesto presents a strong focus on social and economic justice, aiming to reverse policies of the incumbent government. It prioritizes creating jobs, strengthening social safety nets through direct cash transfers and universal services, and upholding constitutional values and democratic institutions. The overall tone is critical of the past decade, positioning itself as a progressive alternative focused on equity, welfare, and freedom.",
            "policy_scores": {
                "Economy": {
                    "score": 1,
                    "explanation": "The party advocates for a mixed economy that supports the private sector but also aims to create jobs, reduce inequality, and provide strong social welfare programs like direct cash transfers to the poor."
                },
                "Education": {
                    "score": 1,
                    "explanation": "The party plans to make public school education free and compulsory up to Class XII and will provide extensive financial aid, including a one-time write-off of all student loans."
                },
                "Technology": {
                    "score": 2,
                    "explanation": "The party supports using technology to improve public services like education while also promising to strengthen data privacy and prevent internet censorship."
                },
                "Environment": {
                    "score": 1,
                    "explanation": "The party proposes creating a powerful independent environmental authority and launching a \"Green New Deal\" to invest heavily in renewable energy and green jobs."
                },
                "Healthcare": {
                    "score": 1,
                    "explanation": "The party pledges to provide universal and free healthcare in public facilities, supported by a government-funded cashless insurance scheme for all citizens."
                },
                "Defense": {
                    "score": 2,
                    "explanation": "The party plans to scrap the current short-term military recruitment scheme (Agnipath) and return to a traditional system that offers permanent jobs and benefits for soldiers."
                },
                "Infrastructure": {
                    "score": 2,
                    "explanation": "The party aims to build infrastructure using both public and private funds but will ensure projects primarily serve the public interest rather than benefiting private companies."
                },
                "Foreign Policy": {
                    "score": 3,
                    "explanation": "The party plans to return to a traditional foreign policy of strategic autonomy and peaceful engagement, aiming to repair relationships with neighbors and strengthen India's role in global institutions."
                },
                "Social Justice": {
                    "score": 1,
                    "explanation": "The party promises to conduct a national caste census and raise the legal limit on reservations for backward classes to ensure greater representation in jobs and education."
                },
                "Agriculture": {
                    "score": 1,
                    "explanation": "The party will give farmers a legal guarantee for minimum support prices for their crops and create a commission to handle agricultural loan forgiveness."
                }
            }
        }
    }
]